using System;

namespace DZ_14_Delegate
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
                Задание 2
                    A. Создайте проект по шаблону Console Application.
                    B. Создать статические методы основных функции калькулятора (-, +, /, *)
                        1. Методы должны принимать 2 обобщённых типов (generic) и возвращать такой
                        же тип в качестве результата
                    C. Создать делегат, соответствующий данным методам и присвоить каждый метод по
                    необходимость от выбора пользователя и присвоить метод как значение к делегату.
                        1. Вызов методов происходит только по средством делегата.
            */


            Console.ReadKey();
        }
    
    }
}
